export const TWBOOKS = {};

TWBOOKS["zh-cn"] = {
  "practical": {
    name: "编程实践",
    books: {
      "basic": [
        "代码整洁之道",
        "单元测试之道",
        "卓有成效的程序员",
        "测试驱动开发",
        "程序员的职业修养",
        "编写可读代码的艺术"
      ],
      "intermediate": [
        "重构与模式",
        "实现模式",
        "代码大全",
        "程序员修炼之道"
      ],
      "advanced": [
        "计算机程序的构造和解释",
        "修改代码的艺术"
      ]
    }
  },
  "architecture": {
    name: "架构与设计",
    books: {
      "basic": [
        "敏捷软件开发：原则、实践与模式",
        "深入浅出设计模式",
        "设计模式"
      ],
      "intermediate": [
        "Unix编程艺术",
        "框架设计的艺术",
        "领域特定语言",
        "企业应用架构模式"
      ],
      "advanced": [
        "发布!软件的设计与部署",
        "领域驱动设计",
        "企业集成模式",
        "架构之美",
        "面向模式的软件架构"
      ]
    }
  },
  "methodology": {
    name: "方法学",
    books: {
      "basic": [
        "用户故事与敏捷方法",
        "金矿",
        "硝烟中的Scrum和XP",
        "持续集成"
      ],
      "intermediate": [
        "精益思想",
        "持续交付",
        "Google软件测试之道",
        "敏捷软件测试",
        "重构极限编程"
      ],
      "advanced": [
        "实例化需求"
      ]
    }
  },
  "leadership": {
    name: "思想与领导力",
    books: {
      "basic": [
        "卓有成效的管理者",
        "你的灯亮着吗",
        "卓有成效的管理者"
      ],
      "intermediate": [
        "第五项修炼",
        "商业设计:通过设计思维构建公司持续竞争优势",
        "管理3.0：培养和提升敏捷领导力",
        "Presentation To Win",
        "麦肯锡方法"
      ],
      "advanced": [
        "思考，快与慢"
      ]
    }
  }
};
